app/views/offices/show.html.erb

SELECT "projects".* FROM "projects" INNER JOIN "offices_projects" ON "projects"."id" = "offices_projects"."project_id" WHERE "offices_projects"."office_id" = ?  [["office_id", 1]]
---
</p>
<% @office.projects.each do |project| %>