app/views/projects/_form.html.erb

SELECT "offices".* FROM "offices"
SELECT  1 AS one FROM "offices" INNER JOIN "offices_projects" ON "offices"."id" = "offices_projects"."office_id" WHERE "offices_projects"."project_id" = ? AND "offices"."id" = ? LIMIT 1  [["project_id", 1], ["id", 1]]
SELECT "offices".* FROM "offices" INNER JOIN "offices_projects" ON "offices"."id" = "offices_projects"."office_id" WHERE "offices_projects"."project_id" = ?  [["project_id", 1]]
---
      <% hidden_field_tag "project[office_ids][]", nil %>
      <% Office.all.each do |office|%>
        <p>
        <%= check_box_tag "project[office_ids][]", office.id, @project.offices.include?(office), :id=>"project_#{office.city}"%>