app/views/projects/show.html.erb

SELECT  "offices".* FROM "offices" INNER JOIN "offices_projects" ON "offices"."id" = "offices_projects"."office_id" WHERE "offices_projects"."project_id" = ?  ORDER BY "offices"."id" ASC LIMIT 1  [["project_id", 1]]
---
                <p><b>Status: </b><%= @project.status %></p>
                <p><b> <%= 'Offices:' if @project.offices.present? %></b>