app/controllers/offices_controller.rb

SELECT "offices".* FROM "offices"
---
  def index
    @offices = Office.all

INSERT INTO "offices" ("city", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["city", "Recife"], ["country", "Brazil"], ["created_at", "2015-09-13 03:57:10.714349"], ["updated_at", "2015-09-13 03:57:10.714349"]]
---
  def create
    @office = Office.new(office_params)

    respond_to do |format|
      if @office.save

UPDATE "offices" SET "country" = ?, "updated_at" = ? WHERE "offices"."id" = ?  [["country", "Brasil"], ["updated_at", "2015-09-14 04:04:20.899614"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @office.update(office_params)

DELETE FROM "offices" WHERE "offices"."id" = ?  [["id", 3]]
---
  def destroy
    @office.destroy

SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_office
      @office = Office.find(params[:id])