app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "description", "picture", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "MyString"], ["description", "MyText"], ["picture", nil], ["status", "MyStatus"], ["created_at", "2015-09-16 04:54:27.664325"], ["updated_at", "2015-09-16 04:54:27.664325"]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "picture" = ?, "status" = ?, "documentation" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["picture", "projector.png"], ["status", "In Development"], ["documentation", ""], ["updated_at", "2015-09-14 14:10:36.741461"], ["id", 2]]